{
  "blogs": [
    {
      "title": "Carlo Ancelotti explains lack of use of academy players after remarkable Sergio Arribas impact",
      "body": "     Real Madrid have not brought through an academy product since the likes of Alvaro Morata and of the current squad, Lucas Vazquez and Nacho Fernandez are the latest representatives of La Fabrica. The former made his bow eight years ago. However after Sergio Arribas came on against Al Ahly and scored almost immediately, the clamour for Carlo Ancelotti to give more minutes to the current generation at Castilla will only grow.\n\nArribas took just 28 seconds to come on and score his goal against Al Ahly in the Club World Cup. Speaking to Marca after the match Ancelotti explained that the academy was very important for Real Madrid.\n\n“It’s a very important issue for us. The youth academy must be taken into account, but at Real Madrid there are players of a very, very high level and that’s why it’s not easy to give them minutes.”\n\n“The youth academy coaches are doing a fantastic job and some of them will soon be in the first team. The Real Madrid squad is the one that has won the European Cup and that means a lot.”\n\nWhile it is true that there are a lot of quality players in the Real Madrid squad already struggling for minutes, there are also holes that might have been filled by academy players.\n\nAt right-back Nacho has been playing almost the entire time that Dani Carvajal and Vazquez have been absent in recent weeks. Ancelotti has moved Eduardo Camavinga, to great effect it should be said, to left-back rather than promoting an more natural option.\n\nPerhaps the most clear example of where Ancelotti might have turned to La Fabrica is up front. With Benzema injured for much of the season, and Mariano Diaz clearly out of favour, Ancelotti has not used a Castilla striker even as an option off the bench.",
      "author": "Fabrizio Romano",
      "id": 17
    },
    {
      "title": "Toni Kroos waiting on condition being filled before committing to Real Madrid renewal",
      "body": "Share to FacebookShare to TwitterShare to WhatsAppShare to EmailShare to More\n\nReal Madrid midfielder Toni Kroos became the player with the most ever World Club Cup medals to his name on Saturday night, starting in their 5-3 win over Al Hilal. Yet the talk afterwards was once again of his potential retirement.\n\nThe German midfielder, already four-and-a-half years retired from international duty, has left it out in the open that he might retire at the end of the season. With little desire to move on from Real Madrid, if he cannot agree to stay on, then he will quit the game at the age of 33.\n\nOut of contract at the end of the year, Real Madrid have a policy of only offering one-year deals to those over the age of 30, but are looking to extend Kroos. The midfielder wants assurances before he does so though.\n\nAs per Todofichajes, Kroos is keen to know whether manager Carlo Ancelotti will also be staying next season before he commits. Ancelotti has a contract until 2024, and despite links to the Brazil job, has reiterated his desire to stay. The issue may come if Real Madrid collapse in the league, Copa del Rey and Champions League, which might inspire Florentino Perez to make a change.\n\nThis tallies with previous reports that Kroos wants guarantees that he will continue to be a key part of the team next season. If it were to be a different manager, then there would obviously be no way of establishing that at this stage.",
      "author": "Fabrizio Romano",
      "id": 18
    },
    {
      "title": "Arsenal news and transfers LIVE: Bukayo Saka injury update, Mac Allister claim, Tierney exit",
      "body": "Arsenal are back on top of the Premier League and things are looking good at the Emirates Stadium for Mikel Arteta. The Gunners moved two points clear of Manchester City with Pep Guardiola's side stumbling to a 1-1 draw against Nottingham Forest at the weekend.\n\nA tough test against Leicester City awaits the Gunners this week but without a game for another six days, it allows a number of players facing injury concerns to recover. Bukayo Saka is 'fine' according to Arteta after an injury scare against Villa, whilst Emile Smith Rowe and Thomas Partey are continuing their recovery from muscle problems.\n\nAlexis Mac Allister could be available to sign in the summer transfer window whilst Declan Rice remains the north Londoners' priority. In terms of outgoings, Kieran Tierney has not started since the Boxing Day victory against West Ham and could be set for a transfer to high-flying Newcastle at the end of the season.\n\nSo, with that being said, stay with us as we keep you up-to-date on all the latest Arsenal transfer gossip, news and other updates here at football.london.",
      "author": "Fabrizio Romano",
      "id": 19
    },
    {
      "title": "1",
      "body": "1",
      "author": "Fabrizio Romano",
      "id": 20
    },
    {
      "title": "1",
      "body": "1",
      "author": "Fabrizio Romano",
      "id": 21
    },
    {
      "title": "2",
      "body": "2",
      "author": "Fabrizio Romano",
      "id": 22
    },
    {
      "title": "3",
      "body": "3",
      "author": "Fabrizio Romano",
      "id": 23
    },
    {
      "title": "3",
      "body": "3",
      "author": "Fabrizio Romano",
      "id": 24
    },
    {
      "title": "4",
      "body": "4",
      "author": "Fabrizio Romano",
      "id": 25
    }
  ]
}